In [1]:
import pandas as pd

In [2]:
pwd

'C:\\Users\\0902s\\Downloads\\Py-DS-ML-Bootcamp-master\\My Notes\\Pandas'

In [3]:
!dir

 Volume in drive C is OS
 Volume Serial Number is BEC8-D130

 Directory of C:\Users\0902s\Downloads\Py-DS-ML-Bootcamp-master\My Notes\Pandas

13-03-2022  17:36    <DIR>          .
13-02-2022  17:39    <DIR>          ..
12-03-2022  17:09    <DIR>          .ipynb_checkpoints
13-03-2022  16:56            41,314 Data Input & Output.ipynb
18-01-2022  19:16                46 example.csv
18-01-2022  19:16             5,508 Excel_Sample.xlsx
13-03-2022  16:44             5,533 Excel_Sample2.xlsx
12-03-2022  02:44            22,493 Groupby.ipynb
12-03-2022  15:10            45,715 Merging, Joining and concatenating.ipynb
12-03-2022  02:21             9,776 Missing Data.ipynb
18-01-2022  19:16               560 multi_index_example
13-03-2022  16:44                51 My_output
12-03-2022  17:09            18,020 Operations.ipynb
12-03-2022  02:02           108,289 Series and Data Frames.ipynb
              11 File(s)        257,305 bytes
               3 Dir(s)  129,543,475,200 bytes free

In [4]:
pd.read_csv('example.csv')       # Reading .csv (& many others) files

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [5]:
df = pd.read_csv('example.csv')

In [6]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [7]:
df.to_csv('My_output')

In [8]:
pd.read_csv('My_output')     # If we don't add index = False, then there is an unammed column

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [9]:
df.to_csv('My_output',index=False)      # Adding index = False

In [10]:
pd.read_csv('My_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [11]:
# Pandas can only inport data
# It cannot import formulas, images or things like macros

In [12]:
pd.read_excel('Excel_Sample.xlsx')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [13]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [14]:
df.to_excel('Excel_Sample2.xlsx',sheet_name='NewSheet')     # making a new excel file

# HTML

In [15]:
!pip install lxml
!pip install html5lib
!pip install BeautifulSoup4

Requirement already satisfied: lxml in c:\users\0902s\anaconda3\lib\site-packages (4.6.3)
Requirement already satisfied: html5lib in c:\users\0902s\anaconda3\lib\site-packages (1.1)
Requirement already satisfied: webencodings in c:\users\0902s\anaconda3\lib\site-packages (from html5lib) (0.5.1)
Requirement already satisfied: six>=1.9 in c:\users\0902s\appdata\roaming\python\python39\site-packages (from html5lib) (1.15.0)
Requirement already satisfied: BeautifulSoup4 in c:\users\0902s\anaconda3\lib\site-packages (4.10.0)
Requirement already satisfied: soupsieve>1.2 in c:\users\0902s\anaconda3\lib\site-packages (from BeautifulSoup4) (2.2.1)

In [24]:
# Reading an HTML file in pandas
# data = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')
data = pd.read_html('file:///C:/Users/0902s/Downloads/Py-DS-ML-Bootcamp-master/My%20Notes/Pandas/temp.html')

In [23]:
data[0]

,Unnamed: 0,Monday,Tuesday,Wednesday,Thursday,Friday
0,Carnivores,Sausage pizza,Corn dogs,Sloppy Joe,Beef taco,Chicken and dumplings
1,Herbivores,Veggie pizza,Veggie dogs,BBQ tempeh,Bean burrito,Tofu teriyaki

In [27]:
defen = pd.read_csv("military expenditure.csv")

In [28]:
defen

,country,iso3c,iso2c,year,Military expenditure (current USD),Military expenditure (% of general government expenditure),Military expenditure (% of GDP),adminregion,incomeLevel
0,Afghanistan,AFG,AF,1970,2.939586e+06,NaN,1.629606,South Asia,Low income
1,Afghanistan,AFG,AF,1971,NaN,NaN,NaN,South Asia,Low income
2,Afghanistan,AFG,AF,1972,NaN,NaN,NaN,South Asia,Low income
3,Afghanistan,AFG,AF,1973,3.341272e+06,NaN,1.868910,South Asia,Low income
4,Afghanistan,AFG,AF,1974,3.581366e+06,NaN,1.610825,South Asia,Low income
...,...,...,...,...,...,...,...,...,...
13561,Zimbabwe,ZWE,ZW,2016,3.580650e+08,7.363048,1.742494,Sub-Saharan Africa (excluding high income),Lower middle income
13562,Zimbabwe,ZWE,ZW,2017,3.405220e+08,5.519890,1.544948,Sub-Saharan Africa (excluding high income),Lower middle income
13563,Zimbabwe,ZWE,ZW,2018,4.203640e+08,5.607096,1.222795,Sub-Saharan Africa (excluding high income),Lower middle income
13564,Zimbabwe,ZWE,ZW,2019,5.469390e+08,2.099816,0.698601,Sub-Saharan Africa (excluding high income),Lower middle income
13565,Zimbabwe,ZWE,ZW,2020,NaN,NaN,NaN,Sub-Saharan Africa (excluding high income),Lower middle income

In [29]:
type(defen)

pandas.core.frame.DataFrame

In [30]:
type(data)

list

# SQL

In [ ]:
# The pandas.io.sql module provides a collection of query wrappers to both facilitate data retrieval and to reduce dependency 
# on DB-specific API. Database abstraction is provided by SQLAlchemy if installed. In addition you will need a driver library 
# for your database. Examples of such drivers are psycopg2 for PostgreSQL or pymysql for MySQL. For SQLite this is included 
# in Python’s standard library by default. You can find an overview of supported drivers for each SQL dialect in the SQLAlchemy 
# docs.

# If SQLAlchemy is not installed, a fallback is only provided for sqlite (and for mysql for backwards compatibility, but this 
# is deprecated and will be removed in a future version). This mode requires a Python database adapter which respect the 
# Python DB-API.

# See also some cookbook examples for some advanced strategies.

# The key functions are:

# read_sql_table(table_name, con[, schema, ...])
# Read SQL database table into a DataFrame.
# read_sql_query(sql, con[, index_col, ...])
# Read SQL query into a DataFrame.
# read_sql(sql, con[, index_col, ...])
# Read SQL query or database table into a DataFrame.
# DataFrame.to_sql(name, con[, flavor, ...])
# Write records stored in a DataFrame to a SQL database.

In [31]:
from sqlalchemy import create_engine

In [33]:
# This has created a temporary very small sequel light engine database that's running in memory 
engine = create_engine('sqlite:///:memory:')

In [34]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [35]:
df.to_sql('my_table',engine)

In [36]:
sqldf=pd.read_sql('my_table',con=engine)

In [37]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15